#перше завдання
x = int(input("ведіть кординату x:"))
y=int(input("ведіть кординату y:"))

if y > 0 and x > 0:
    print(f"точка {x, y}, знаходиться в першій четверті")

elif y > 0 and x < 0:
    print(f"точка {x, y}, знаходиться в другій четверті")

elif y < 0 and x < 0:
    print(f"точка {x, y}, знаходиться в третій четверті")

elif y < 0 and x > 0:
    print(f"точка {x, y} знаходиться в четвертій четверті")

else:
    print(f"точка {x, y} точка не належить ні жодній четверті")
#2 завдання

name = input("ведіть своє ім'я:")
score = int(input("ведіть свій бал:"))

if 100 >= score >= 80:
    print(f"студент {name} здав іспит")

elif score < 80:
    print(f"студент {name} іспит не складено")
else:
    print("бали рахуються від 1 до 100")